Collinear segments are not allowed in a Rebar Shape definition.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CurvesCollinear { get; }
  Visual Basic
Public Shared ReadOnly Property CurvesCollinear As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CurvesCollinear {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarShapeFailures Class
  Autodesk.Revit.DB Namespace